#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/tech-challenge-fase-3-iac/runs/run-Ur6Q91NoUZ7WuXGQ

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
module.nat_gateway.aws_eip.this: Refreshing state... [id=eipalloc-0a9a23f69386f177b]
module.db_password_secret.aws_secretsmanager_secret.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:721525683170:secret:lanchonete-db-pwd-i2450G]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/lanchonete-eks-cluster/cluster]
module.eks.module.kms.data.aws_partition.current: Refreshing...
module.eks.data.aws_partition.current: Refreshing...
module.eks.data.aws_caller_identity.current: Refreshing...
data.aws_iam_role.lab_role: Refreshing...
module.lanchonete_vpc.aws_vpc.this: Refreshing state... [id=vpc-0645c9ed43e0cc037]
module.lanchonete_http_api.aws_apigatewayv2_api.this: Refreshing state... [id=yedv13j998]
module.eks.module.kms.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current: Refreshing...
module.eks.data.aws_caller_identity.current: Refresh complete after 0s [id=721525683170]
module.eks.module.kms.data.aws_caller_identity.current: Refresh complete after 0s [id=721525683170]
data.aws_iam_role.lab_role: Refresh complete after 0s [id=LabRole]
module.db_password_secret.aws_secretsmanager_secret_version.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:721525683170:secret:lanchonete-db-pwd-i2450G|terraform-20241216222836098500000002]
module.eks.module.eks_managed_node_group["labs"].data.aws_partition.current: Refreshing...
module.eks.module.eks_managed_node_group["labs"].data.aws_caller_identity.current: Refreshing...
module.eks.module.eks_managed_node_group["labs"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refreshing...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refresh complete after 0s [id=427788031]
module.eks.module.eks_managed_node_group["labs"].data.aws_caller_identity.current: Refresh complete after 0s [id=721525683170]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=377835ee-9d06-42c0-ba5f-607db3445a65]
module.lanchonete_http_api.aws_apigatewayv2_stage.this: Refreshing state... [id=$default]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/lanchonete-eks-cluster]
module.lanchonete_eks_private_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-00cdaea04bcd24663]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-00b361e21ca946330]
module.lanchonete_private_rt.aws_route_table.this: Refreshing state... [id=rtb-0fa33b8351f836483]
module.lanchonete_public_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-00e6a8d16157269d2]
module.internet_gateway.aws_internet_gateway.this: Refreshing state... [id=igw-0dec75d5a2b87d0fc]
module.lanchonete_eks_private_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-0d93c1ccd28f5b4f8]
module.lanchonete_db_private_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-001642fcf43e1b09c]
module.lanchonete_public_rt.aws_route_table.this: Refreshing state... [id=rtb-0d730d2f61e4efd38]
module.lanchonete_public_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-02a0f8dabc2d10ba2]
module.lanchonete_rds_sg.aws_security_group.this: Refreshing state... [id=sg-0aa69a58b786edd83]
module.lanchonete_db_private_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-07806e23613eab91e]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0539ac03272fef687]
aws_route.lanchonete_public_inet_route: Refreshing state... [id=r-rtb-0d730d2f61e4efd381080289494]
aws_route_table_association.eks_private_rta: Refreshing state... [id=rtbassoc-0447fa69f3dfd5669]
module.lanchonete_http_api.aws_apigatewayv2_vpc_link.this: Refreshing state... [id=ebxfqq]
aws_route_table_association.lanchonete_private_rtb_db_b: Refreshing state... [id=rtbassoc-0ea0f0f1ad66b5b62]
aws_route_table_association.eks_private_rtb: Refreshing state... [id=rtbassoc-0a62843e52c65893a]
aws_route_table_association.lanchonete_public_rta: Refreshing state... [id=rtbassoc-0b46221734bc81da6]
module.nat_gateway.aws_nat_gateway.this: Refreshing state... [id=nat-044fc4d63aeff711d]
aws_route_table_association.lanchonete_public_rtb: Refreshing state... [id=rtbassoc-07aefaac025219fff]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-531686292]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3718040586]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3107848129]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1711664176]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-4112412422]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-50734103]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3837092548]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1249962833]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1089126699]
aws_route.lanchonete_private_inet_route: Refreshing state... [id=r-rtb-0fa33b8351f8364831080289494]
aws_route_table_association.lanchonete_private_rta_db_a: Refreshing state... [id=rtbassoc-059e78af905003a87]
module.lanchonete_rds.aws_db_subnet_group.this: Refreshing state... [id=lanchonete-subnet-group]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=lanchonete-eks-cluster]
module.lanchonete_rds.aws_db_instance.this: Refreshing state... [id=db-R5QF5SUVHXMXOSGATGQE7HMUGM]
module.eks.aws_eks_cluster.this[0]: Drift detected (update)
module.lanchonete_rds.aws_db_instance.this: Drift detected (update)
╷
│ Warning: Argument is deprecated
│
│   with module.eks.aws_eks_addon.this["coredns"],
│   on .terraform/modules/eks/main.tf line 380, in resource "aws_eks_addon" "this":
│  380:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
╵
╷
│ Warning: Argument is deprecated
│
│   with module.eks.aws_eks_addon.this["eks-pod-identity-agent"],
│   on .terraform/modules/eks/main.tf line 380, in resource "aws_eks_addon" "this":
│  380:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
╵
╷
│ Warning: Argument is deprecated
│
│   with module.eks.aws_eks_addon.this["vpc-cni"],
│   on .terraform/modules/eks/main.tf line 380, in resource "aws_eks_addon" "this":
│  380:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
╵
╷
│ Warning: Argument is deprecated
│
│   with module.eks.aws_eks_addon.this["kube-proxy"],
│   on .terraform/modules/eks/main.tf line 380, in resource "aws_eks_addon" "this":
│  380:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
╵

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.aws_eks_cluster.this[0] has changed
  ~ resource "aws_eks_cluster" "this" {
        id                            = "lanchonete-eks-cluster"
        name                          = "lanchonete-eks-cluster"
      ~ status                        = "ACTIVE" -> "DELETING"
        tags                          = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "eks-pod-identity-agent"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] must be replaced
+/- resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-east-1:721525683170:log-group:/aws/eks/lanchonete-eks-cluster/cluster" -> (known after apply)
      ~ id                = "/aws/eks/lanchonete-eks-cluster/cluster" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/eks/lanchonete-eks-cluster/cluster" -> "/aws/eks/lanchonete-g41-cluster/cluster" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "Provisioner" = "Terraform"
        }
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Provisioner"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Provisioner"
      + resource_id = (known after apply)
      + value       = "Terraform"
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "coredns"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "lanchonete-g41-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Provisioner" = "Terraform"
        }
      + tags_all             = {
          + "Provisioner" = "Terraform"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["eks-pod-identity-agent"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "eks-pod-identity-agent"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "lanchonete-g41-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Provisioner" = "Terraform"
        }
      + tags_all             = {
          + "Provisioner" = "Terraform"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "kube-proxy"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "lanchonete-g41-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Provisioner" = "Terraform"
        }
      + tags_all             = {
          + "Provisioner" = "Terraform"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "lanchonete-g41-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Provisioner" = "Terraform"
        }
      + tags_all             = {
          + "Provisioner" = "Terraform"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                           = "arn:aws:eks:us-east-1:721525683170:cluster/lanchonete-eks-cluster" -> (known after apply)
      ~ certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJVlh5MGVDRzZYbDh3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRFeU1UWXlNakUxTVRKYUZ3MHpOREV5TVRReU1qSXdNVEphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURTaHFBTXBWSkJWdDlhcTFKRnFDekpTeTBhOHArMnZhWjNqRnc4TE5ub0h3L3NEN1BnWkRGSjFBUW4KejRmbk9XejFLY0I0TzJwVGt1WlV1WWpQMnZNVVMvYXFtTlRBZVlLR29TcTI1SUhzQi9rdEtiOHVRM295Rk00KwpkY0lzbytvS09nM0orQWo0NjBOMlZLNHZzSkI3UUxacVc4emxUdlk0MWdZV0Y1WXVWQ2NKTFVmTllYM09Zb3Q2ClFHK1R4T0V5NVJLZjlaVEdDTVlvOWYyYnVwVWo5NWNHamozaFhZZzFWK2E5cGNEcDBtS0Nod0NUMzU0YjhSSU8KbVlqRUJVVytNWW5nbm5yZHp1SW1WL1pFRExJclVOYUpLMkVpMC9raUtuTEx1dTZQSmpIclE4czhSemJYeDNUQQp4Q1NMUHd0QVh3VlhQM2g1c2hCOW94RzE5UHNuQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRWFp1QUdTS2U4Y2Z6NytiQ2lhVXVxd3ZEMm9UQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQXNQendkOXlQdApNcERGQU1zN2k1L3kvekdYMFVQeTYrSDJ6dFZlRTZYYW5XNWw0MkhyT01pU1Vac1M0UGJwUFMvVTFpbmp0VElyCi9UTEswaEFaTng0ZjVBOXpiWTVJMytyN2szMEtFdVlBWnkzelBqSFdSd1lHSUpiUzlFdDFEYm4xZ2Zxa2IwNFIKN3dlYXhTbTlTSXgxcFE4ZkpBTmNPMzN4bGw4enoxWHYyTHdxdXhlWjJVYkpWNDBaNlQ5Y3M0czhLbDVhd284Ngo4KzVidWdGK1NWeFlWNkFlNlBaYjV5cnRBUzQ4YlJGYVJHNmNhUWZCNXk1K1ZpZVR6NkxuWGZJT3pXV3RzV0JRCkkzYjBIbU9CWFpkTEt5c3RUQ0ptVFVYTWcrbVpFUHdBbHlFbkRqUUlmQ09CdXRyczFEY3ltNVlyYWR2WXNFeTgKZXBVODBBLzBJdW44Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                    = (known after apply)
      ~ created_at                    = "2024-12-16T22:15:30Z" -> (known after apply)
      ~ endpoint                      = "https://5913B344122E88065FCB1274D3F70147.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                            = "lanchonete-eks-cluster" -> (known after apply)
      ~ identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/5913B344122E88065FCB1274D3F70147"
                    },
                ]
            },
        ] -> (known after apply)
      ~ name                          = "lanchonete-eks-cluster" -> "lanchonete-g41-cluster"
      ~ platform_version              = "eks.15" -> (known after apply)
      ~ status                        = "DELETING" -> (known after apply)
      ~ tags                          = {
          - "Environment" = "dev" -> null
          + "Provisioner" = "Terraform"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all                      = {
          - "Environment" = "dev" -> null
          + "Provisioner" = "Terraform"
          - "Terraform"   = "true" -> null
        }
        # (4 unchanged attributes hidden)

      ~ access_config (known after apply)
      - access_config {
          - authentication_mode                         = "CONFIG_MAP" -> null
          - bootstrap_cluster_creator_admin_permissions = true -> null
        }

      ~ kubernetes_network_config {
          ~ ip_family         = "ipv4" -> (known after apply)
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
          + service_ipv6_cidr = (known after apply)

          ~ elastic_load_balancing (known after apply)
          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      ~ upgrade_policy (known after apply)
      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-07278b3e78844184a" -> (known after apply)
          ~ security_group_ids        = [
              - "sg-00b361e21ca946330",
            ] -> (known after apply)
          ~ vpc_id                    = "vpc-0645c9ed43e0cc037" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.aws_security_group.cluster[0] must be replaced
+/- resource "aws_security_group" "cluster" {
      ~ arn                    = "arn:aws:ec2:us-east-1:721525683170:security-group/sg-00b361e21ca946330" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-00b361e21ca946330" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Node groups to cluster API"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0539ac03272fef687",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "lanchonete-eks-cluster-cluster-20241216221515536000000005" -> (known after apply)
      ~ name_prefix            = "lanchonete-eks-cluster-cluster-" -> "lanchonete-g41-cluster-cluster-" # forces replacement
      ~ owner_id               = "721525683170" -> (known after apply)
      ~ tags                   = {
          ~ "Name"        = "lanchonete-eks-cluster-cluster" -> "lanchonete-g41-cluster-cluster"
            "Provisioner" = "Terraform"
        }
      ~ tags_all               = {
          ~ "Name"        = "lanchonete-eks-cluster-cluster" -> "lanchonete-g41-cluster-cluster"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.node[0] must be replaced
+/- resource "aws_security_group" "node" {
      ~ arn                    = "arn:aws:ec2:us-east-1:721525683170:security-group/sg-0539ac03272fef687" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all egress"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0539ac03272fef687" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 8443/tcp webhook"
              - from_port        = 8443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-00b361e21ca946330",
                ]
              - self             = false
              - to_port          = 8443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 9443/tcp webhook"
              - from_port        = 9443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-00b361e21ca946330",
                ]
              - self             = false
              - to_port          = 9443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node groups"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-00b361e21ca946330",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node kubelets"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-00b361e21ca946330",
                ]
              - self             = false
              - to_port          = 10250
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS UDP"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node ingress on ephemeral ports"
              - from_port        = 1025
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 65535
            },
        ] -> (known after apply)
      ~ name                   = "lanchonete-eks-cluster-node-20241216221515536200000006" -> (known after apply)
      ~ name_prefix            = "lanchonete-eks-cluster-node-" -> "lanchonete-g41-cluster-node-" # forces replacement
      ~ owner_id               = "721525683170" -> (known after apply)
      ~ tags                   = {
          ~ "Name"                                         = "lanchonete-eks-cluster-node" -> "lanchonete-g41-cluster-node"
            "Provisioner"                                  = "Terraform"
          - "kubernetes.io/cluster/lanchonete-eks-cluster" = "owned" -> null
          + "kubernetes.io/cluster/lanchonete-g41-cluster" = "owned"
        }
      ~ tags_all               = {
          ~ "Name"                                         = "lanchonete-eks-cluster-node" -> "lanchonete-g41-cluster-node"
          - "kubernetes.io/cluster/lanchonete-eks-cluster" = "owned" -> null
          + "kubernetes.io/cluster/lanchonete-g41-cluster" = "owned"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] must be replaced
+/- resource "aws_security_group_rule" "cluster" {
      ~ id                       = "sgrule-1249962833" -> (known after apply)
      ~ security_group_id        = "sg-00b361e21ca946330" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0cb9ab71343a0b7c7" -> (known after apply)
      ~ source_security_group_id = "sg-0539ac03272fef687" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_all"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-50734103" -> (known after apply)
      ~ security_group_id        = "sg-0539ac03272fef687" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0e26f0f0febd71971" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-1711664176" -> (known after apply)
      ~ security_group_id        = "sg-0539ac03272fef687" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-075743a69c0d200a6" -> (known after apply)
      ~ source_security_group_id = "sg-00b361e21ca946330" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3718040586" -> (known after apply)
      ~ security_group_id        = "sg-0539ac03272fef687" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0853053d1cc325489" -> (known after apply)
      ~ source_security_group_id = "sg-00b361e21ca946330" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3107848129" -> (known after apply)
      ~ security_group_id        = "sg-0539ac03272fef687" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0828b64b32bfb17b7" -> (known after apply)
      ~ source_security_group_id = "sg-00b361e21ca946330" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-4112412422" -> (known after apply)
      ~ security_group_id        = "sg-0539ac03272fef687" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-01637681878d255f8" -> (known after apply)
      ~ source_security_group_id = "sg-00b361e21ca946330" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-531686292" -> (known after apply)
      ~ security_group_id        = "sg-0539ac03272fef687" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-09c6e7236b9bbe94e" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3837092548" -> (known after apply)
      ~ security_group_id        = "sg-0539ac03272fef687" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0a2a3f0f2ad4200aa" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-1089126699" -> (known after apply)
      ~ security_group_id        = "sg-0539ac03272fef687" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0c4d1921c70695847" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["labs"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "lanchonete-g41-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "labs-"
      + node_role_arn          = "arn:aws:iam::721525683170:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00cdaea04bcd24663",
          + "subnet-0d93c1ccd28f5b4f8",
        ]
      + tags                   = {
          + "Name"        = "labs"
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Name"        = "labs"
          + "Provisioner" = "Terraform"
        }
      + version                = "1.31"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["labs"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for labs EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "labs-"
      + tags                   = {
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Provisioner" = "Terraform"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"        = "labs"
              + "Provisioner" = "Terraform"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"        = "labs"
              + "Provisioner" = "Terraform"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"        = "labs"
              + "Provisioner" = "Terraform"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] must be replaced
-/+ resource "aws_kms_alias" "this" {
      ~ arn            = "arn:aws:kms:us-east-1:721525683170:alias/eks/lanchonete-eks-cluster" -> (known after apply)
      ~ id             = "alias/eks/lanchonete-eks-cluster" -> (known after apply)
      ~ name           = "alias/eks/lanchonete-eks-cluster" -> "alias/eks/lanchonete-g41-cluster" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:us-east-1:721525683170:key/377835ee-9d06-42c0-ba5f-607db3445a65" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
      ~ description                        = "lanchonete-eks-cluster cluster encryption key" -> "lanchonete-g41-cluster cluster encryption key"
        id                                 = "377835ee-9d06-42c0-ba5f-607db3445a65"
        tags                               = {
            "Provisioner" = "Terraform"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 21 to add, 1 to change, 14 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*